"use strict";
// Homework_11
Object.defineProperty(exports, "__esModule", { value: true });
// --------------
// TASK_01
// -----------------
document.write(`<p>Task_01</p>`);
document.write(`<p style="color: #8ceec0f5;">Знайти суми елементів у вказаній області 
    (зафарбована область охоплює відповідну половину рядків і стовпців)</p>`);
document.write(`<p style="color: #8ceec0f5;"> 1) номери рядків від 0 до половини, стовпці від 0 до половини</p>`);
document.write(`<p style="color: #8ceec0f5;"> 2) номери рядків від 0 до половини, стовпці від половини до кінця</p>`);
document.write(`<p style="color: #8ceec0f5;"> 3) номери рядків (від половини до кінця, стовпці від 0 до половини</p>`);
document.write(`<p style="color: #8ceec0f5;"> 4) номери рядків від половини до кінця , стовпці від половини до кінця</p>`);
document.write(`<p style="color: #8ceec0f5;"> 5) Суму парних рядків</p>`);
document.write(`<p style="color: #8ceec0f5;"> 6) Суму непарних стовпців</p>`);
document.write(`<p style="color: #8ceec0f5;"> 7) У парних рядках – непарні стовпці, у непарних – парні</p>`);
console.log();
document.write();
// ----------------
// TASK_02
// -------------------
document.write(`<p>Task_02</p>`);
document.write(`<p style="color: #8ceec0f5;"> Дано інформацію про прибуток К магазинів протягом тижня. Знайти :</p>`);
document.write(`<p style="color: #8ceec0f5;"> 1) загальний прибуток кожного масиву за тиждень;</p>`);
document.write(`<p style="color: #8ceec0f5;"> 2) загальний прибуток усіх магазинів по дням (загальний прибуток усіх магазинів за понеділок, за вівторок, і т.д.);</p>`);
document.write(`<p style="color: #8ceec0f5;"> 3) загальний прибуток за робочі дні</p>`);
document.write(`<p style="color: #8ceec0f5;"> 4) загальний прибуток за вихідні дні</p>`);
document.write(`<p style="color: #8ceec0f5;"> 5) максимальний прибуток за середу</p>`);
document.write(`<p style="color: #8ceec0f5;"> 6) сформувати загальний список (одновимірний масив) зі значенням, які що більші за 200</p>`);
document.write(`<p style="color: #8ceec0f5;"> 7) відсортувати кожен тиждень за зростанням</p>`);
document.write(`<p style="color: #8ceec0f5;"> 8) відсортувати тижні (рядки) за спаданням максимального елементи у цьому тижні (рядку), тобто 
    при порівнянні рядків потрібно порівнювати максимальні елементи у кожному з цих рядків</p>`);
document.write(`<p style="color: #8ceec0f5;"> 9) упорядкувати тижні (рядки) за спаданням суми 
    елементів у рядку (тобто при порівнянні двох рядків треба знайти суму кожного з рядків і порівнювати 
    ці суми, на основі цих сум буде зрозуміло, який з елементів повинен іти раніше)</p>`);
console.log();
document.write();
// --------------
// TASK_03
// ----------------
document.write(`<p>Task_03</p>`);
document.write(`<p style="color: #8ceec0f5;">Морський бій. Випадковим чином на двовимірному полі розміром 6*6 розташовується 5 кораблів. 
    Користувач стріляє вказуючи координати. Гра продовжується поки не потоплено усі кораблі або у користувача не закінчаться снаряди.</p>`);
console.log();
document.write();
//# sourceMappingURL=script.js.map